Repository: joshika39/highschool
Catalog: C#/Library/Library/strings.*.resx
Languages: hu_hu, ja_jp

# WelcomeText
source: Welcome to Joshua's Library Manager
hu_hu: Üdvözöllek Joshua Könyvtárkezelőjében.
ja_jp: ジョシュアの図書館のマネージャーへようこそ

# AnswerNo
source: No
hu_hu: Nem
ja_jp: いいえ

# AnswerYes
source: Yes
hu_hu: Igen
ja_jp: はい

# BookTitle
source: Title of the book:
hu_hu: Könyv címe
ja_jp: 本の題名:

# BookAuthor
source: Author of the book:
hu_hu: Könyv írója
ja_jp: 本の著者：

# InfoCommandsAddText
source: If you wish to perform something check the following commands: - 'u' is for users. - 'b' is for books.
hu_hu: Ha szeretnél valamit végrehajtani, vedd figyelembe a következő parancsokat: - "u" a felhasználók. - "b" a könyvek
ja_jp: 何かを実行したい場合は、次のコマンドを確認してください。 -「u」はユーザー用です。 -「b」は本用です。

# InfoCommandsText
source: If you wish to perform something check the following commands: - 'a' is for adding. - 'r' is for read. - 'm' is for modifying something. - 'b' is for borrowing books. - 'q' is for quit from the program. - 'esc' is for going up one menu level.
hu_hu: Ha szeretnél valamit végrehajtani, vedd figyelembe a következő parancsokat: - "a" a hozzáadáshoz - "r" az olvasáshoz - "m" a módosításhoz - "b" a könyvkivételhez - "q" a kilépéshez - "esc" egy menüvel való visszalépéshez
ja_jp: 何かを実行したい場合は、次のコマンドを確認してください。 -「a」は追加用です。 -「r」は読み取り用です。 -「m」は何かを変更するためのものです。 -「b」は本を借りるためのものです。 -「q」はプログラムを終了するためのものです。 -「esc」は1つのメニューレベルを上げるためのものです

# InfoWantToReturnOrBorrow
source: What do you want? Return a book or borrow a book? - 'b' when borrow a book. - 'r' when return a book.
hu_hu: Mit szeretne? Visszahozni, vagy kivenni? - "b" amikot kivenni. - "r" amikor visszahozni
ja_jp: なんでしょう？ 本を返却しますか、それとも本を借りますか？ -本を借りるときは「b」。 -本を返すときは「r」。

# InfoWrongInput
source: !!! __Incorrect option, please select from below.__ !!!
hu_hu: !!! __ Rossz opció, kérlek válassz megfelelőt lentról.__ !!!
ja_jp: !!! __オプションが正しくありません。以下から選択してください。__!!!

# InfoWrongInputValue
source: Incorrect value, please enter in some number:
ja_jp: 値が正しくありません。いくつかの数値を入力してください。

# PropertyAge
source: , Age: {2}
hu_hu: , Kor: {2}
ja_jp: 、年齢：{2}

# PropertyAuthor
source: , Author: {2}
hu_hu: , Szerző: {2}
ja_jp: 、作成者：{2}

# PropertyBorrowed
source: The book is borrowed: {0}
hu_hu: A köny ki van véve:
ja_jp: 本は借りられます：{0}

# PropertyEmail
source: , Email: {3}
ja_jp: 、メール：{3}

# PropertyID
source: Id: {0}
ja_jp: アイディー: {0}

# PropertyPremium
source: Premium user: {0}
hu_hu: Premuim Felhasználó: {0}
ja_jp: プレミアムユーザー：{0}

# PropertyReturned
source: The book is returned: {0}
ja_jp: 本が返されます：{0}

# PropertyTitle
source: , Title: {1}
hu_hu: , Cím: {1}
ja_jp: 、題名: {0}

# PropertyUserName
source: , Name: {1}
hu_hu: , Név: {1}
ja_jp: 、氏名{1}

# UserAge
source: Enter Your Age:
hu_hu: Yrd be a korod:
ja_jp: 年齢を入力して：

# UserEmail
source: Enter your email:
hu_hu: Írd be az emailed:
ja_jp: メール電を入力して：

# UserName
source: Enter your name:
hu_hu: Írd be a neved:
ja_jp: 指名を入力して：

# UserNumberText
source: The number of the users logged in to the library is: {0}
hu_hu: A felhasználók száma a könyvtárban: {0}
ja_jp: ライブラリにログインしているユーザーの数は次のとおりです：{0}

# WhatToAdd
source: What do you want to add?
hu_hu: Mit szeretne hozzáadni?
ja_jp: 何を追加しますか？

# WhatToRead
source: What do you want to read?
hu_hu: Mit szeretne kiolvasni?
ja_jp: 何を読みたいですか？

# HowToModify
source: How to you want to modify? If you wish to perform something check the following commands: - 'd' is for delete something.
hu_hu: Ha szeretnél módosítani valamit, akkor használd a következő parancsokat: "d" - a kitörléskez
ja_jp: どのように変更したいですか？ 何かを実行したい場合は、次のコマンドを確認してください。 -「d」は何かを削除するためのものです。

# InfoAdded
source: Added!
hu_hu: Hozzáadva
ja_jp: 追加しました！

# ErrorUserFileNotFound
source: There is no file for users or books yet. Add some!
hu_hu: Még nincs file a felhasználóknak, vagy könyveknek.
ja_jp: ユーザーや本のファイルはまだありません。 いくつか追加してください！

# ErrorBookFileNotFound
source: There is no file for users or books yet. Add some!
hu_hu: Még nincs file a felhasználóknak, vagy könyveknek.
ja_jp: ユーザーや本のファイルはまだありません。 いくつか追加してください！

# BookNumberText
source: The number of the book in the library is: {0}
hu_hu: A könyvek száma a könyvtárban: {0}
ja_jp: 図書館の本の数は次のとおりです：{0}

source: Your Choice:
hu_hu: Válasz:
ja_jp: あなたの選択:

# InfoUnderDevelopement
source: This feature is still under development!
hu_hu: Ez a funkcó még mindig fejlesztés alatt van!
ja_jp: この機能はまだ開発中です！
